app/views/users/show.html.erb

SELECT "leagues".* FROM "leagues" WHERE "leagues"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "leagues" WHERE "leagues"."user_id" = ?  [["user_id", 10]]
---
<div>
  <% if @user.leagues.count == 0 %>