app/controllers/leagues_controller.rb

INSERT INTO "leagues" ("FG39down", "FG40to49", "FG50up", "FGmissed", "PAT", "created_at", "defBlock", "defFumbRec", "defINT", "defSack", "defSafety", "defTD", "fumbLost", "intThrown", "name", "passTDs", "passYds", "ptsAllowed0", "ptsAllowed14to17", "ptsAllowed18to27", "ptsAllowed1to6", "ptsAllowed28to34", "ptsAllowed35to45", "ptsAllowed46plus", "ptsAllowed7to13", "recTDs", "recYds", "retTDs", "rushTDs", "rushYds", "twoPt", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @league = current_user.leagues.new(league_params)
    # @statCat = (standardScore => params[:ScoringRule][:passTDs], name => params[:ScoringRule])
    if @league.save

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "7"]]
---
  def show
    @league = League.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "8"]]
---
  def edit
    @league = League.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "leagues" SET "passTDs" = ?, "passYds" = ?, "intThrown" = ?, "rushTDs" = ?, "rushYds" = ?, "recTDs" = ?, "recYds" = ?, "twoPt" = ?, "retTDs" = ?, "fumbLost" = ?, "FG50up" = ?, "FG40to49" = ?, "FG39down" = ?, "PAT" = ?, "FGmissed" = ?, "defTD" = ?, "defINT" = ?, "defFumbRec" = ?, "defBlock" = ?, "defSafety" = ?, "defSack" = ?, "ptsAllowed0" = ?, "ptsAllowed1to6" = ?, "ptsAllowed7to13" = ?, "ptsAllowed14to17" = ?, "ptsAllowed18to27" = ?, "ptsAllowed28to34" = ?, "ptsAllowed35to45" = ?, "ptsAllowed46plus" = ?, "updated_at" = ? WHERE "leagues"."id" = 1
---
  def update
    @league = League.find(params['id'])
    @league.update(league_params)

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "leagues" WHERE "leagues"."id" = ?  [["id", 8]]
---
  def destroy
    @league = League.find(params['id'])
    @league.destroy