app/controllers/predraft_rankings_controller.rb

  def show
    @league = League.find(params[:id])
    rbs=@league.players.where(:position => 'RB')
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "players".* FROM "players" INNER JOIN "predraft_rankings" ON "players"."id" = "predraft_rankings"."player_id" WHERE "predraft_rankings"."league_id" = ? AND "players"."position" = 'RB'  [["league_id", 1]]