app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
puts "JERRY: " + user_params
    @user = User.new(user_params)
    if @user.save!